Revit 2027 API
PDFExportOptions.OriginOffsetX Property
 Offset between left sides of pdf content and paper. Always stored in unit of Feet.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double OriginOffsetX { get; set; }
Public Property OriginOffsetX As Double
	Get
	Set
public:
property double OriginOffsetX {
	double get ();
	void set (double value);
}
member OriginOffsetX : float with get, set
Property Value
Double
See Also
Reference
PDFExportOptions Class
Autodesk.Revit.DB Namespace